АлогистикТест2/src/DataProcessors/алк_РМ_СборкаРазборкаПакетов/алк_РМ_СборкаРазборкаПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_СборкаРазборкаПакетов</name>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПроизводства</name>
    <type>
      <types>DocumentRef.алк_Производство</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разборка</name>
    <attributes>
      <name>Количество</name>
      <comment>Это Объем</comment>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сборка</name>
    <attributes>
      <name>Количество</name>
      <comment>Это Объем</comment>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерПакета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/DataProcessors/алк_РМ_СборкаРазборкаПакетов/Forms/ПодборСоставаПакета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ПМ") Тогда //СГП ПМ (сборка/разборка)
		Элементы.ТаблицаПодбораПрипуск.Видимость = Истина;
		Элементы.ТаблицаПодбораКатегорияПЭО.Видимость = Истина;
		Элементы.ТаблицаПодбораГабарит.Видимость = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресХранилицаТЗПодбора") Тогда
		ТЗИзХранилища = ПолучитьИзВременногоХранилища(Параметры.АдресХранилицаТЗПодбора);
		ТаблицаПодбора.Загрузить(ТЗИзХранилища);
		УдалитьИзВременногоХранилища(Параметры.АдресХранилицаТЗПодбора);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ОповеститьОВыборе(ТаблицаПодбора);	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Стр Из ТаблицаПодбора Цикл
		Стр.КоличествоДоступно = Стр.Количество;
		Стр.КоличествоСоставДоступно = Стр.КоличествоСостав;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораКоличествоРезультатПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаПодбора.ТекущиеДанные;
	Если ТекДанные.Количество > ТекДанные.КоличествоДоступно Тогда 
		ТекДанные.Количество = ТекДанные.КоличествоДоступно;
		ТекДанные.КоличествоСостав = ТекДанные.КоличествоСоставДоступно;
		Сообщить("Объем подобранного не может быть больше доступного");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораКоличествоСоставПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаПодбора.ТекущиеДанные;
	ТекДанные.Количество = РасчитатьОбъем(ТекДанные.Характеристика, ТекДанные.КоличествоСостав);
	ТаблицаПодбораКоличествоРезультатПриИзменении(Ложь);
	ОбновитьИтоги();
КонецПроцедуры

Функция РасчитатьОбъем(ХарактеристикаПоиска, КоличествоШтук)
	Возврат КоличествоШтук * РегистрыСведений.алк_ПараметрыХарактеристик.ПолучитьОбъемПоХарактеристике(ХарактеристикаПоиска); 
КонецФункции

&НаКлиенте
Процедура ОбновитьИтоги()
	ИтогоКоличество = 0;
	ИтогоКоличествоСостав = 0;
	Для Каждого Стр Из ТаблицаПодбора Цикл
		Если Стр.Выбрать Тогда
			ИтогоКоличество =  ИтогоКоличество + Стр.Количество;
			ИтогоКоличествоСостав = ИтогоКоличествоСостав + Стр.КоличествоСостав;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораВыбратьПриИзменении(Элемент)
	ОбновитьИтоги();
КонецПроцедуры
